---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
VertexPair Properties
VertexPair Class See Also Send Feedback
---

The VertexPair type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | First | Identifies the first index of VertexPair. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Second | Identifies the second index of VertexPair. |

# See Also

VertexPair Class

Autodesk.Revit.DB Namespace